// 1)
// let x = 5;
// alert(x++); // будет равно 5
// alert(++x); // будет равно 6

// 2)Пустой массив равен пустой строке
//console.log([] + false - null + true) // при выполнении операций с разными типами данных будет NaN

// 3)

// let y = 1;
// let x = y = 2;
// alert(x) // res = 2

// 4)

// console.log([] + 1 + 3); // 13

// 5)

// alert('1'[0]) // res = 1

// 6)

// console.log(2 && 1 && null && 0 && undefined); // null

// 7)

// console.log(!!(1 && 2) === (1 && 2)); // !! - превращет выражение в буллиновое

// 8)
// console.log(null || 2&&3 || 4);